Revit 2027 API
SlabShapeEditor.ModifySubElement(SlabShapeVertex, Double) Method
Manipulates the vertex on the corresponding slab, roof or floor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ModifySubElement(
	SlabShapeVertex vertex,
	double offset
)
Public Sub ModifySubElement (
	vertex As SlabShapeVertex,
	offset As Double
)
public:
void ModifySubElement(
	SlabShapeVertex^ vertex,
	double offset
)
member ModifySubElement :
        vertex : SlabShapeVertex *
        offset : float -> unit
Parameters
vertex SlabShapeVertex
The vertex.
offset Double
The new value of the vertex offset.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the vertex is null.
ArgumentException |  Thrown when the vertex is invalid.
See Also
Reference
SlabShapeEditor Class
ModifySubElement Overload
Autodesk.Revit.DB Namespace